***Q1***

In [3]:
import pandas as pd 
data = [4,8,15,16,23,42]
series = pd.Series(data)
print(series)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

***Q2***

In [4]:
import pandas as pd

my_list = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
series = pd.Series(my_list)
print(series)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

***Q3***

In [8]:
import pandas as pd

data = {
    'Name': ['Alice', 'Bob', 'Claire'],
    'Age': [25, 30, 27],
    'Gender': ['Female', 'Male', 'Female']
}

df = pd.DataFrame(data)
print(df)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

***Q4***

In Pandas, a DataFrame is a two-dimensional labeled data structure that represents tabular data, similar to a table in a relational database.

A Pandas Series, on the other hand, is a one-dimensional labeled array that can hold data of any type. e.g. numeric, string, datetime .

In [10]:
import pandas as pd

data = {
    'Name': ['Alice', 'Bob', 'Claire'],
    'Age': [25, 30, 27],
    'Gender': ['Female', 'Male', 'Female']
}

df = pd.DataFrame(data)
print(df)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

This example, we have created a DataFrame named df with three columns: 'Name', 'Age', and 'Gender'. Each column is a Pandas Series.
And  the DataFrame provides a tabular structure to hold and organize these Series together, allowing us to work with the data as a whole.

***Q5***

some common functions we use to manipulate data in a Pandas DataFrame :

head(): 
These functions allow you to view the first few rows.

tail():
The last few rows 


info():
 This function provides a concise summary of the DataFrame
 
 
describe():
 This function generates descriptive statistics of the numerical columns in the DataFrame.

example: Q4question make dataframe :

In [14]:
df.head(2)

    Name  Age  Gender
0  Alice   25  Female
1    Bob   30    Male

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Age     3 non-null      int64
 2   Gender  3 non-null      object
dtypes: int64(1), object(2)
memory usage: 200.0+ bytes

In [16]:
df.describe()

             Age
count   3.000000
mean   27.333333
std     2.516611
min    25.000000
25%    26.000000
50%    27.000000
75%    28.500000
max    30.000000

***Q6***

Series: A Pandas Series is mutable, which means you can modify the values within a Series after it is created. You can assign new values to specific positions in the Series, add or remove elements, and perform various other operations to modify the Series.



DataFrame:A Pandas DataFrame is mutable. You can change the values in individual cells, add or remove rows or columns, update the column names or index labels, and perform a wide range of data manipulations to modify the DataFrame.

Panel: However, Panel is not mutable.It was intended to represent three-dimensional data, but it has been replaced with other data structures like MultiIndex DataFrame or xarray for more efficient handling of multi-dimensional data.

***Q7***

In [18]:
import pandas as pd


name_series = pd.Series(['Alice', 'Bob', 'Claire'])
age_series = pd.Series([25, 30, 27])
gender_series = pd.Series(['Female', 'Male', 'Female'])


df = pd.DataFrame({
    'Name': name_series,
    'Age': age_series,
    'Gender': gender_series
})


print(df)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female